Catalogs/бит_ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ВариантыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипВарианта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыВариантовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВарианта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ВариантыОтчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрочиеПроцедурыИФункции

//  Процедура изменяет признак "ИспользоватьПриОткрытии" у указнанного варианта.
// При установке признака в "Истина" выполняется проверка в рамках варианта у других настроек.
// Признак сбрасывается в "Ложь".
//
// Параметры:
//  ТекущийВариант  - СправочникСсылка.бит_ВариантОтчета.
//  ИспользоватьПриОткрытии - Булево.
//
Процедура ИзменитьИспользоватьПриОткрытии(ТекущийВариант, ИспользоватьПриОткрытии) Экспорт

	Если ТекущийВариант.ИспользоватьПриОткрытии <> ИспользоватьПриОткрытии Тогда
		
		СпрОб = ТекущийВариант.ПолучитьОбъект();
		СпрОб.ИспользоватьПриОткрытии = ИспользоватьПриОткрытии;
		флДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОб,, "Ошибки");
		
		Если флДействиеВыполнено И ИспользоватьПриОткрытии Тогда
			
			СброситьИспользоватьПриОткрытии(ТекущийВариант);
			
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры // ИзменитьОткрыватьПоУмолчанию()

//  Процедура сбрасывает признак "ИспользоватьПриОткрытии" у всех вариантов. 
// не равных текущей в пределах варианта.
//
// Параметры:
//  ТекущийВариант  - СправочникСсылка.бит_ВариантОтчета.
//
Процедура СброситьИспользоватьПриОткрытии(ТекущийВариант) Экспорт

	Если Не ТекущийВариант.ИспользоватьПриОткрытии Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийВариант", ТекущийВариант);
	Запрос.УстановитьПараметр("КлючОбъекта", ТекущийВариант.КлючОбъекта);
	Запрос.Текст = " 
	|ВЫБРАТЬ
    |	бит_ВариантыОтчетов.Ссылка
    |ИЗ
    |	Справочник.бит_ВариантыОтчетов КАК бит_ВариантыОтчетов
    |ГДЕ
    |	бит_ВариантыОтчетов.ИспользоватьПриОткрытии
    |	И бит_ВариантыОтчетов.Ссылка <> &ТекущийВариант
    |	И бит_ВариантыОтчетов.КлючОбъекта = &КлючОбъекта
	|";
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ИзменитьИспользоватьПриОткрытии(Выборка.Ссылка, Ложь);
	
	КонецЦикла; 

КонецПроцедуры // СброситьИспользоватьПриОткрытии()
   
//  Функция создает и записывает элемент справочника бит_ВариантыОтчетов.
//
// Параметры:
//  СтруктураПараметров  - Структура.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_ВариантыОтчетов.
//
Функция СоздатьВариант(СтруктураПараметров) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	СпрОб = Справочники.бит_ВариантыОтчетов.СоздатьЭлемент();
	// Заполним Наименование, КлючОбъекта, Ответственный, ИспользоватьПриОткрытии, ТипВарианта.  
	ЗаполнитьЗначенияСвойств(СпрОб, СтруктураПараметров);
	СпрОб.КлючВарианта       	  = Строка(Новый УникальныйИдентификатор());
	
	флДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОб,, "Ошибки");
	
	Если флДействиеВыполнено Тогда
	   РезВариант = СпрОб.Ссылка;
	   Если СтруктураПараметров.ИспользоватьПриОткрытии Тогда
	   
	   		Справочники.бит_ВариантыОтчетов.СброситьИспользоватьПриОткрытии(СпрОб.Ссылка);
	   
	   КонецЕсли; 
	Иначе	
	   РезВариант = Справочники.бит_ВариантыОтчетов.ПустаяСсылка();
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	                   	
	Возврат РезВариант;
	
КонецФункции // СоздатьВариант()

#КонецОбласти

#КонецЕсли
